Ran Plan for project: `ecs/demo/tmcd_apnortheast2` dir: `terraform/ecs/demo/tmcd_apnortheast2` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.iam: Reading...
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 1s
data.terraform_remote_state.iam: Read complete after 1s
module.ecs_service.data.aws_partition.current: Reading...
module.ecs_service.data.aws_region.current: Reading...
module.alb.data.aws_partition.current: Reading...
module.ecs_service.module.container_definition["demo"].data.aws_region.current: Reading...
module.ecs_service.data.aws_subnet.this[0]: Reading...
module.ecs_service.data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.alb.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.module.container_definition["demo"].data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=066346343248]
module.ecs_service.data.aws_subnet.this[0]: Read complete after 0s [id=subnet-08d60c5582e7bab2c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.alb.aws_lb.this[0] will be created
+ resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "demo-tmcdapne2"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-066f15f574c7f1a3d",
          + "subnet-0a33d6a2708cc9f5c",
        ]
      + tags                                                         = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + timeouts {}
    }

  # module.alb.aws_lb_listener.this["blue"] will be created
+ resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ap-northeast-2:066346343248:certificate/10d501d4-a8c8-4358-9996-98060a907e47"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-Res-2021-06"
      + tags              = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all          = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_listener.this["green"] will be created
+ resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8080
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all          = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.this["blue"] will be created
+ resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "5"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = "true"
      + name                               = "demo-blue"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                           = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-02bd27f3ad9337b18"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.alb.aws_lb_target_group.this["green"] will be created
+ resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "5"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = "true"
      + name                               = "demo-green"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                           = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-02bd27f3ad9337b18"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.alb.aws_route53_record.this["demo"] will be created
+ resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "demo"
      + type            = "A"
      + zone_id         = "Z09601362JG8MSL8LJAHR"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.alb.aws_security_group.this[0] will be created
+ resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for demo-tmcdapne2 application load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "demo-tmcdapne2-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                 = "vpc-02bd27f3ad9337b18"
    }

  # module.alb.aws_vpc_security_group_egress_rule.this["all"] will be created
+ resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
    }

  # module.alb.aws_vpc_security_group_ingress_rule.this["all_http"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "121.136.217.18/32"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Name"                  = "demo-tmcdapne2"
          + "terraform-aws-modules" = "alb"
        }
      + to_port                = 443
    }

  # module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/demo-tmcdapne2"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Name" = "demo-tmcdapne2"
        }
      + tags_all          = {
          + "Name" = "demo-tmcdapne2"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster.this[0] will be created
+ resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "demo-tmcdapne2"
      + tags     = {
          + "Name" = "demo-tmcdapne2"
        }
      + tags_all = {
          + "Name" = "demo-tmcdapne2"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "DEFAULT"
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
+ resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "demo-tmcdapne2"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 1
        }
      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # module.ecs_service.data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "demo-tmcdapne2"
      + task_role_arn        = (known after apply)
    }

  # module.ecs_service.aws_appautoscaling_policy.this["cpu"] will be created
+ resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs_service.aws_appautoscaling_policy.this["memory"] will be created
+ resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs_service.aws_appautoscaling_target.this[0] will be created
+ resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = (known after apply)
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "Name" = "demo-tmcdapne2"
        }
      + tags_all           = {
          + "Name" = "demo-tmcdapne2"
        }
    }

  # module.ecs_service.aws_ecs_service.this[0] will be created
+ resource "aws_ecs_service" "this" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "demo-tmcdapne2"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name"       = "demo-tmcdapne2"
          + "ServiceTag" = "Tag on service level"
        }
      + tags_all                           = {
          + "Name"       = "demo-tmcdapne2"
          + "ServiceTag" = "Tag on service level"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "CODE_DEPLOY"
        }

      + load_balancer {
          + container_name   = "demo"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }
      + load_balancer {
          + container_name   = "demo"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-00954dff2b638bdd8",
              + "subnet-08d60c5582e7bab2c",
            ]
        }

      + timeouts {}
    }

  # module.ecs_service.aws_ecs_task_definition.this[0] will be created
+ resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment            = []
                  + image                  = "066346343248.dkr.ecr.ap-northeast-2.amazonaws.com/demoapp:d2edeae84"
                  + interactive            = false
                  + linuxParameters        = {
                      + initProcessEnabled = false
                    }
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/demo-tmcdapne2/demo"
                          + awslogs-region        = "ap-northeast-2"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + mountPoints            = []
                  + name                   = "demo"
                  + portMappings           = [
                      + {
                          + containerPort = 8080
                          + name          = "demo"
                          + protocol      = "tcp"
                        },
                    ]
                  + privileged             = false
                  + pseudoTerminal         = false
                  + readonlyRootFilesystem = false
                  + startTimeout           = 30
                  + stopTimeout            = 120
                  + systemControls         = []
                  + user                   = "0"
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = "arn:aws:iam::066346343248:role/demo-tmcdapne2-task-exec"
      + family                   = "demo-tmcdapne2"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "demo-tmcdapne2"
        }
      + tags_all                 = {
          + "Name" = "demo-tmcdapne2"
        }
      + task_role_arn            = "arn:aws:iam::066346343248:role/demo-tmcdapne2-task"
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "my-vol"
        }
    }

  # module.ecs_service.aws_security_group.this[0] will be created
+ resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "demo-tmcdapne2-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "demo-tmcdapne2"
        }
      + tags_all               = {
          + "Name" = "demo-tmcdapne2"
        }
      + vpc_id                 = "vpc-02bd27f3ad9337b18"
    }

  # module.ecs_service.aws_security_group_rule.this["alb_ingress_8080"] will be created
+ resource "aws_security_group_rule" "this" {
      + description              = "Service port"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.ecs_service.aws_security_group_rule.this["egress_all"] will be created
+ resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ecs_service.module.container_definition["demo"].aws_cloudwatch_log_group.this[0] will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/demo-tmcdapne2/demo"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "demo-tmcdapne2"
        }
      + tags_all          = {
          + "Name" = "demo-tmcdapne2"
        }
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ alb_blue_listener_arn       = (known after apply)
+ alb_blue_target_group_name  = "demo-blue"
+ alb_green_listener_arn      = (known after apply)
+ alb_green_target_group_name = "demo-green"
+ ecs_cluster_name            = "demo-tmcdapne2"
+ ecs_service_arn             = (known after apply)
+ ecs_service_name            = "demo-tmcdapne2"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p ecs/demo/tmcd_apnortheast2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fecs%252Fdemo%252Ftmcd_apnortheast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p ecs/demo/tmcd_apnortheast2`
</details>
Plan: 21 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
